package com.example.vidyarthi_lalkitab.utils

object PanchangConstants {

    val TITHI = arrayOf(
        "પ્રતિપદા","દ્વિતીયા","તૃતીયા","ચતુર્થી","પંચમી",
        "ષષ્ઠી","સપ્તમી","અષ્ટમી","નવમી","દશમી",
        "એકાદશી","દ્વાદશી","ત્રયોદશી","ચતુર્દશી","પૂર્ણિમા",
        "પ્રતિપદા","દ્વિતીયા","તૃતીયા","ચતુર્થી","પંચમી",
        "ષષ્ઠી","સપ્તમી","અષ્ટમી","નવમી","દશમી",
        "એકાદશી","દ્વાદશી","ત્રયોદશી","ચતુર્દશી","અમાવસ્યા"
    )

    val NAKSHATRA = arrayOf(
        "અશ્વિની","ભરણિ","કૃતિકા","રોહિણી","મૃગશિરા","આર્દ્રા",
        "પુનર્વસુ","પુષ્ય","આશ્લેષા","મઘા","પૂર્વ ફાલ્ગુની",
        "ઉત્તર ફાલ્ગુની","હસ્ત","ચિત્રા","સ્વાતિ","વિશાખા",
        "અનુરાધા","જ્યેષ્ઠા","મૂળ","પૂર્વાષાઢા","ઉત્તરાષાઢા",
        "શ્રવણ","ધનિષ્ઠા","શતભિષા",
        "પૂર્વ ભાદ્રપદ","ઉત્તર ભાદ્રપદ","રેવતી"
    )

    val YOGA = arrayOf(
        "વિષ્કુંભ","પ્રીતિ","આયુષ્માન","સૌભાગ્ય","શોભન","અતિગંડ",
        "સુકર્મા","ધૃતિ","શૂલ","ગંડ","વૃદ્ધિ","ધ્રુવ",
        "વ્યાઘાત","હર્ષણ","વજ્ર","સિદ્ધિ","વ્યતીપાત",
        "વરીયાન","પરિઘ","શિવ","સિદ્ધ","સાધ્ય","શુભ",
        "શુક્લ","બ્રહ્મ","ઇન્દ્ર","વૈધૃતિ"
    )
}
