package com.vidyarthi.lalkitab.utils

object PanchangConstants {

    /* ── TITHI ── */
    val TITHI_NAMES = arrayOf(
        "પ્રતિપદા","દ્વિતિયા","તૃતિયા","ચતુર્થી","પંચમી",
        "ષષ્ઠી","સપ્તમી","અષ્ટમી","નવમી","દશમી",
        "એકાદશી","દ્વાદશી","ત્રયોદશી","ચતુર્દશી","પૂર્ણિમા",
        "પ્રતિપદા","દ્વિતિયા","તૃતિયા","ચતુર્થી","પંચમી",
        "ષષ્ઠી","સપ્તમી","અષ્ટમી","નવમી","દશમી",
        "એકાદશી","દ્વાદશી","ત્રયોદશી","ચતુર્દશી","અમાવાસ્યા"
    )

    /* ── NAKSHATRA ── */
    val NAKSHATRA_NAMES = arrayOf(
        "અશ્વિની","ભરણિ","કૃત્તિકા","રોહિણી","મૃગશીર્ષ",
        "આર્દ્રા","પુનર્વસુ","પુષ્ય","આશ્લેષા","મઘા",
        "પૂર્વા ફાલ્ગુની","ઉત્તરા ફાલ્ગુની","હસ્ત","ચિત્રા","સ્વાતી",
        "વિશાખા","અનુરાધા","જ્યેષ્ઠા","મૂલ","પૂર્વાષાઢા",
        "ઉત્તરાષાઢા","શ્રવણ","ધનિષ્ઠા","શતભિષા",
        "પૂર્વા ભાદ્રપદ","ઉત્તરા ભાદ્રપદ","રેવતી"
    )

    /* ── YOGA ── */
    val YOGA_NAMES = arrayOf(
        "વિષ્કુંભ","પ્રીતિ","આયુષ્માન","સૌભાગ્ય","શોભન",
        "અતિગંડ","સુકર્મા","ધૃતિ","શૂલ","ગંડ",
        "વૃદ્ધિ","ધ્રુવ","વ્યાઘાત","હર્ષણ","વજ્ર",
        "સિદ્ધિ","વ્યતિપાત","વરીયાન","પરિઘ","શિવ",
        "સિદ્ધ","સાધ્ય","શુભ","શુક્લ","બ્રહ્મ",
        "ઇન્દ્ર","વૈધૃતિ"
    )

    /* ── KARANA ── */
    val KARANA_NAMES = arrayOf(
        "બવ","બાલવ","કૌલવ","તૈતિલ","ગર","વણિજ","વિષ્ટિ",
        "બવ","બાલવ","કૌલવ","તૈતિલ","ગર","વણિજ","વિષ્ટિ",
        "બવ","બાલવ","કૌલવ","તૈતિલ","ગર","વણિજ","વિષ્ટિ",
        "બવ","બાલવ","કૌલવ","તૈતિલ","ગર","વણિજ","વિષ્ટિ",
        "શકુની","ચતુષ્પદ","નાગ","કિંસ્તુઘ્ન"
    )

    /* ── MAAS ── */
    val MAAS = arrayOf(
    "ચૈત્ર","વૈશાખ","જેઠ","અષાઢ",
    "શ્રાવણ","ભાદરવો","આસો","કારતક",
    "માગશર","પોષ","મહા","ફાગણ"
)

    /* ── HORA ── */
    val HORA_LORDS = arrayOf(
        "સૂર્ય","શુક્ર","બુધ","ચંદ્ર","શનિ","ગુરુ","મંગળ"
    )
}
